src/lib/sugarsoapBinding.set_document_revision.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.sugarcrm.com/sugarcrm">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:set_document_revision>
   <session></session>
   <note>
    <id></id>
    <document_name></document_name>
    <revision></revision>
    <filename></filename>
    <file></file>
   </note>
  </ns1:set_document_revision>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
